Catalogs/ГруппыРассылокИОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ГруппыРассылокИОповещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принудительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПартнераДляПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииПартнераДляSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииКонтактногоЛицаДляПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииКонтактногоЛицаДляSMS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьПартнеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКонтактномуЛицуОбъектаОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьКонтактнымЛицамРоли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыРассылокИОповещений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ПредназначенаДляЭлектронныхПисем И Не ПредназначенаДляSMS Тогда
		
		ТекстОшибки = НСтр("ru = 'Не указан ни один вид доставки сообщений.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ПредназначенаДляЭлектронныхПисем",
			,
			Отказ);
		
	КонецЕсли;
	
	Если Не ПредназначенаДляЭлектронныхПисем Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("УчетнаяЗапись");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииКонтактногоЛицаДляПисем");
		
	КонецЕсли;
	
	Если Не ПредназначенаДляSMS Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииПартнераДляSMS");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииКонтактногоЛицаДляSMS");
		
	КонецЕсли;
	
	Если Принудительная И Не ОтправлятьПартнеру Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииПартнераДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииПартнераДляSMS");
		
	КонецЕсли;
	
	Если Принудительная И (Не ОтправлятьКонтактнымЛицамРоли) И (Не ОтправлятьКонтактномуЛицуОбъектаОповещения) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииКонтактногоЛицаДляПисем");
		МассивНепроверяемыхРеквизитов.Добавить("ВидКонтактнойИнформацииКонтактногоЛицаДляSMS");
		
	КонецЕсли;
	
	Если Не ОтправлятьКонтактнымЛицамРоли Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("РольКонтактногоЛица");
		
	КонецЕсли;
	
	Если Принудительная Тогда
		
		Если Не ОтправлятьПартнеру 
			 И Не ОтправлятьКонтактномуЛицуОбъектаОповещения 
			 И Не ОтправлятьКонтактнымЛицамРоли Тогда
			
			ТекстОшибки = НСтр("ru = 'Необходимо указать хотя бы один вид адресатов.'");
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"ОтправлятьПартнеру",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не Принудительная Тогда
		
		ОтправлятьПартнеру                         = Ложь;
		ОтправлятьКонтактномуЛицуОбъектаОповещения = Ложь;
		ОтправлятьКонтактнымЛицамРоли              = Ложь;
		
	КонецЕсли;
	
	Если Не ОтправлятьКонтактнымЛицамРоли Тогда
		РольКонтактногоЛица = Справочники.РолиКонтактныхЛицПартнеров.ПустаяСсылка();
	КонецЕсли;
	
	ТребуетсяУказаниеКИПартнера        = Не Принудительная Или ОтправлятьПартнеру;
	ТребуетсяУказаниеКИКонтактногоЛица = Не Принудительная Или ОтправлятьКонтактномуЛицуОбъектаОповещения Или ОтправлятьКонтактнымЛицамРоли;
	
	Если Не ПредназначенаДляЭлектронныхПисем И ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	КонецЕсли;
	
	Если (Не ПредназначенаДляЭлектронныхПисем) Или (Не ТребуетсяУказаниеКИПартнера) 
		И ЗначениеЗаполнено(ВидКонтактнойИнформацииПартнераДляПисем) Тогда
		ВидКонтактнойИнформацииПартнераДляПисем = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли;
	
	Если (Не ПредназначенаДляЭлектронныхПисем) Или (Не ТребуетсяУказаниеКИКонтактногоЛица) 
		И ЗначениеЗаполнено(ВидКонтактнойИнформацииКонтактногоЛицаДляПисем) Тогда
		ВидКонтактнойИнформацииКонтактногоЛицаДляПисем = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли;
	
	Если (Не ПредназначенаДляSMS) Или (Не ТребуетсяУказаниеКИКонтактногоЛица)
		И ЗначениеЗаполнено(ВидКонтактнойИнформацииКонтактногоЛицаДляSMS) Тогда
		ВидКонтактнойИнформацииКонтактногоЛицаДляSMS = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли;
	
	Если (Не ПредназначенаДляSMS) Или (Не ТребуетсяУказаниеКИПартнера) 
		И ЗначениеЗаполнено(ВидКонтактнойИнформацииПартнераДляSMS) Тогда
		ВидКонтактнойИнформацииПартнераДляSMS = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
